/**
  ******************************************************************************
  * @file    Gimbal_APIFunction.h
  * @author  26赛季，平衡步兵电控，马帅
  * @date    2026.1.10
  * @brief   云台功能函数头文件
  ******************************************************************************
*/
#ifndef __GIMBAL_APIFUNCTION_H
#define __GIMBAL_APIFUNCTION_H

#include "GlobalDeclare_Gimbal.h"

//#region /**** 结构体声明************************************************************************/


/*************************云台正式结构体的数据修改、处理、更新相关函数************************************/
/****各种FB反馈数据的修改、处理、更新相关函数*****/



/****各种Des目标数据的修改、处理、更新相关函数****/



/************各种数据的重置、清零函数**********/


/**********************************云台的解算相关函数******************************************/



/**********************************云台其他相关函数********************************************/
void Gimbal_AllFBDataUpdate(void);
void GM_MotorProcess(void);
float Angle_Inf_To_180(float angle);
void Vision_StateMode_Update(void);
void Vision_Switch_Process(void);


#endif
